# Cashflow

## --------------------------------- CASHFLOW ----------------------------------
## script for creating and manipulating personal cashflow 
## ---------------------------------------------------------------------------------------

### Important information:
##### This script assumes several details. Read them all and make the desired changes!

### Source incomes considered:

+ salary, bonuses, self_emp (self employed), freelance, gov_ben (government benefits),

+ pension, retirement, others (put one keyword)

### Source expenses considered:

+ Fixed (type): rent, mobility, insurance, taxes, other_fixed

+ Variable (type): groceries, utilities, medical care, education, maintenance, entertainament,

+ eating out, other_variable

#### Flow:

1 - Income will be manipulated to create data

2 - the same for expenses

3 - Balance

4 - Exporting files: xlsx files with the summary

## 1. Income

In [1]:
# packages/modules
import pandas as pd
import datetime

### 1.1 Detailing the data: incomes

In [109]:
# read incomes
inc = pd.read_csv('income.csv', delimiter=';')
inc.head()

# create auxiliar date column (but data refer to end of month)
inc['date_op'] = pd.to_datetime(inc['year'].astype(str)  + inc['month'], format='%Y%B')
# order by date:
inc.sort_values('date_op', inplace=True)

### 1.2 Managing the data - operations done with the income values

In [110]:
# 1.2.1 Group incomes by date
# Flow: by date; by source; all through year -> month

# only by year first
inc_date = inc.groupby([inc['year']], as_index=False)

# operation:
# total income per year
inc_per_year = inc_date.sum()
inc_per_year.head()

   year  value
0  2018  47415
1  2019  48950

In [111]:
# and by year and month: overwritting by the year
inc_date = inc.groupby([inc['date_op'], inc['month'], inc['year']], as_index=False)

# operations:
# total income per month of the year
inc_per_month = inc_date.sum()
inc_per_month.head()

     date_op     month  year  value
0 2018-01-01   january  2018   3900
1 2018-02-01  february  2018   3975
2 2018-03-01     march  2018   3900
3 2018-04-01     april  2018   3900
4 2018-05-01       may  2018   3900

In [112]:
# 1.2.2 income grouped by date and sources

# only by year first (and sources)
inc_src = inc.groupby([inc['year'], inc['source']], as_index=False)

# operations:
# total income per year and source
inc_per_ysrc = inc_src.sum()
inc_per_ysrc.head()

   year     source  value
0  2018  freelance    495
1  2018  gov_benef    120
2  2018     salary  46800
3  2019  freelance    750
4  2019  gov_benef    200

In [113]:
# and by year, month and source
# income grouped by year and sources
inc_src = inc.groupby([inc['date_op'], inc['month'], inc['source'], inc['year']], as_index=False)

# operation:
# total monthly income per source
inc_per_msrc = inc_src.sum()
inc_per_msrc.head()

     date_op     month     source  year  value
0 2018-01-01   january     salary  2018   3900
1 2018-02-01  february  freelance  2018     75
2 2018-02-01  february     salary  2018   3900
3 2018-03-01     march     salary  2018   3900
4 2018-04-01     april     salary  2018   3900

## 2. Expenses

### 2.1 Detailing the data:  Expenses

In [114]:
# read data
exp = pd.read_csv('expenses.csv', delimiter=';')

# create auxiliar date column 
exp['date_op'] = pd.to_datetime(exp['year'].astype(str)  + exp['month'], format='%Y%B')
# order by date:
exp.sort_values('date_op', inplace=True)

In [115]:
# expenses grouped by type: fixed and variable
# the nomenclature of this script matters.
# see at the beginning the terms and classification: changes can be made!

fxd_exp = ['rent', 'mobility', 'insurance', 'taxes', 'other_fixed']

var_exp = ['groceries', 'utilities', 'medical', 'education', 'maint', 'entmt',
           'out_food', 'other_var']

exp['type'] = ['fixed' if x in fxd_exp else 'variable' for x in exp['source']]
exp.head()

    year     month    source  value    date_op      type
54  2018   january      rent   1000 2018-01-01     fixed
86  2018   january  out_food    150 2018-01-01  variable
66  2018   january   medical    300 2018-01-01  variable
76  2018   january  mobility    100 2018-01-01     fixed
55  2018  february      rent   1000 2018-02-01     fixed

### 2.2 Managing the data - operations to be done with expenses values

In [ ]:
# 2.2.1 Group expenses by date
# only by year first
exp_date = exp.groupby([exp['year']], as_index=False)
exp_date.head()

# operation:
# total expenses per year
exp_per_year = exp_date.sum()
exp_per_year.head()

In [116]:
# and by year and month:
exp_date = exp.groupby([exp['date_op'], exp['month'], exp['year']], as_index=False)
exp_date.head()

# operations:
# total expenses per month of the year
exp_per_month = exp_date.sum()
exp_per_month.head()

     date_op     month  year  value
0 2018-01-01   january  2018   1550
1 2018-02-01  february  2018   1465
2 2018-03-01     march  2018   1400
3 2018-04-01     april  2018   1600
4 2018-05-01       may  2018   1800

In [117]:
# 2.2.2 Group expenses by date and sources
# only by year first
exp_src = exp.groupby([exp['year'], exp['source']], as_index=False)

# operations:
# total expenses per year and source
exp_per_ysrc = exp_src.sum()
exp_per_ysrc.head()

   year     source  value
0  2018  education    800
1  2018      entmt    480
2  2018  insurance   1000
3  2018    medical   3600
4  2018   mobility   3100

In [118]:
# and by year, month and source
# expenses grouped by year and sources
exp_src = exp.groupby([exp['date_op'], exp['month'], exp['source'], exp['year']], as_index=False)

# operation:
# total monthly expenses per source
exp_per_msrc = exp_src.sum()
exp_per_msrc.head()

     date_op     month    source  year  value
0 2018-01-01   january   medical  2018    300
1 2018-01-01   january  mobility  2018    100
2 2018-01-01   january  out_food  2018    150
3 2018-01-01   january      rent  2018   1000
4 2018-02-01  february   medical  2018    300

In [119]:
# 2.2.3 Group expenses by date and type (fixed or variable)
# only by year first
exp_typ = exp.groupby([exp['year'], exp['type']], as_index=False)

# operations:
# total expenses per year and source
exp_per_ytyp = exp_typ.sum()
exp_per_ytyp.head()

   year      type  value
0  2018     fixed  16100
1  2018  variable   6010
2  2019     fixed  16500
3  2019  variable   8345

In [120]:
# and by year, month and type
# expenses grouped by year and types
exp_typ = exp.groupby([exp['date_op'], exp['month'], exp['type'], exp['year']], as_index=False)

# operation:
# total monthly expenses per source
exp_per_mtyp = exp_typ.sum()
exp_per_mtyp.head()

     date_op     month      type  year  value
0 2018-01-01   january     fixed  2018   1100
1 2018-01-01   january  variable  2018    450
2 2018-02-01  february     fixed  2018   1100
3 2018-02-01  february  variable  2018    365
4 2018-03-01     march     fixed  2018   1100

## 3. Balance

In [121]:
# dataframes used:
# inc_per_year, inc_per_month

# What was calculated:
# 1. Balance of income (annual and monthly): absolute diff of income between current and previous month
# 2. Balance of expenses (annual and monthly): idem (for expenses values)
# 3. Overall balance: income - expenses

In [122]:
# 3.1
# Income year:
inc_per_year.sort_values('year', inplace=True)
inc_per_year.head()

   year  value
0  2018  47415
1  2019  48950

In [123]:
# yib = year income balance
for i in range(1, len(inc_per_year)):
    yib = inc_per_year.value - inc_per_year.value.shift(1)
    inc_per_year['yib'] = yib

# mib = month income balance
for i in range(1, len(inc_per_month)):
    mib = inc_per_month.value - inc_per_month.value.shift(1)
    inc_per_month['mib'] = mib

In [124]:
# 3.2
# Expenses year:
exp_per_year.sort_values('year', inplace=True)
exp_per_year.head()

     year  value
0  108972  22110
1  109026  24845

In [125]:
# yeb = year expenses balance
for i in range(1, len(exp_per_year)):
    yeb = exp_per_year.value - exp_per_year.value.shift(1)
    exp_per_year['yeb'] = yeb

# meb = month expenses balance
for i in range(1, len(exp_per_month)):
    meb = exp_per_month.value - exp_per_month.value.shift(1)
    exp_per_month['meb'] = meb

In [126]:
# 3.3
# overall monthly balance - (not considering sources)
# inc_per_month - exp_per_mon
gen_bal = inc_per_month['value'] - exp_per_month['value']

In [127]:
# appending the overall monthly balance to exp_per_month dataframe:
exp_per_month['gen_bal'] = gen_bal

## 5. Export results

In [128]:
# what to export: (all dfs):
# inc_per_year, inc_per_month, inc_per_ysrc, inc_per_msrc
# exp_per_year, exp_per_month, exp_per_ysrc, exp_per_msrc, exp_per_ytyp, exp_per_mtyp
# using module XlsxWriter and pandas

In [129]:
# export income and its balances:
writer = pd.ExcelWriter('income_bal.xlsx', engine='xlsxwriter')
inc_per_year.to_excel(writer, sheet_name='year_bal')
inc_per_month.to_excel(writer, sheet_name='month_bal')
inc_per_ysrc.to_excel(writer, sheet_name='source_year')
inc_per_msrc.to_excel(writer, sheet_name='source_month')
writer.save()

In [130]:
# export expenses. its balances and general balance:
writer = pd.ExcelWriter('expenses_bal.xlsx', engine='xlsxwriter')
exp_per_year.to_excel(writer, sheet_name='year_bal')
exp_per_month.to_excel(writer, sheet_name='month_bal')
exp_per_ysrc.to_excel(writer, sheet_name='source_year')
exp_per_msrc.to_excel(writer, sheet_name='source_month')
exp_per_ytyp.to_excel(writer, sheet_name='type_year')
exp_per_mtyp.to_excel(writer, sheet_name='type_month')
writer.save()